Revit 2027 API
BuiltInFailures.FaceSplitterFailures.LoopsOutsideFaceSplitError Property
 Some of the lines drawn lie outside of the boundary of the face being split. All lines used to split a face must be contained within the face being split and cannot intersect or overlap any of the boundaries of that face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LoopsOutsideFaceSplitError { get; }
Public Shared ReadOnly Property LoopsOutsideFaceSplitError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LoopsOutsideFaceSplitError {
	FailureDefinitionId^ get ();
}
static member LoopsOutsideFaceSplitError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FaceSplitterFailures Class
Autodesk.Revit.DB Namespace